const list = [
  {
    id: '1',
    title: '门诊部',
    content:
      '<p>重庆市精神卫生中心门诊部秉承“以患者为中心”的服务理念，不断拓宽服务项目、深化服务内涵，提高医疗服务质量，以精湛的技术、高尚的医德服务于患者、服务于社会。</p><p>门诊部集诊断、治疗、处置等日常医疗、卫生宣教于一体，由一批技术精湛、经验丰富的各专科领域的医疗人员组成，其中有国务院政府津贴专家、重庆市知名精神、心理卫生专家等。为方便患者就医，开发多渠道预约挂号方式，实行双休日及节假日门诊制度和弹性工作制；常年开设精神科普通门诊，根据社会需求还开设了睡眠、心身疾病、老年记忆、早期干预、儿童青少年5个专病门诊；实施特殊人群的免、减和优惠活动。</p><p>咨询电话：</p><p>金紫山院区 67511695</p><p>歌乐山院区 65504118</p><p>近年来，精神心理疾病的发病率日益增高，其辅助诊断技术也在不断的发展和提升。为了更快更准确的做出医疗诊断，评估患者治疗效果，我院于2019年引进了世界先进技术---- 近红外脑功能定量成像技术。</p><p>近红外脑功能定量成像技术是一种无痛、无创、实时、连续的功能性神经影像技术，采用一定波段的近红外光检测大脑皮层的氧合血红蛋白和脱氧血红蛋白的浓度变化，从而了解脑代谢情况，实现了不同脑区多通道同时检测，对精神疾病的早期预防、诊断和治疗提供了客观的影像学证据。</p><p>此技术弥补了精神科不能提供量化性指标辅助检查的空白。为疾病诊断、严重程度评估、病情变化判断、治疗方案选择、治疗效果评价等提供了较为准确的专业建议，同时极大程度的提高了患者的治疗配合度和服药依从性。且检查费用低，在提供精准治疗的基础上，较大程度的降低了患者的经济负担。</p>',
  },
  {
    id: '2',
    title: '普通精神',
    content:
      '<p>两院区普通精神科共设有两个女病区，五个男病区，主要收治精神分裂症，情感性精神障碍等精神疾病，采用药物、心理、康复治疗等综合治疗方法，注重对患者的人文关怀，其疗效深得患者及家属的好评。现有医务人员 150余人，其中高级职称医师15人。</p>',
  },
  {
    id: '3',
    title: '临床心理科',
    content:
      '<p>临床心理科成立于1992年，是我中心唯一的完全开放病房，病房环境接近家居生活，有标准的单人间、双人间、三人间供选择。每间病房均有独立阳台、卫生间、电话、电视、空调、热水器。实行星级服务，人性化管理。强调健康从心开始，注重心理社会因素对健康的影响。自由，宽松、安全、温馨的环境是病人康复的重要条件。</p><p>病房主要收治因心理、社会、生物因素导致的心理疾病，如：焦虑症（包括社交焦虑症）、强迫症、恐怖症、抑郁症、神经衰弱、心身疾病、睡眠障碍、进食障碍、适应障碍等。</p><p>也许您曾经因为身体的病痛，生活的困窘，工作的压力在漫长的深夜里辗转反侧，难以入眠；也许您的心灵在痛苦中被桎梏，在挣扎，在呐喊；也许您曾经为此做过了漫长而痛苦的求医之路，感到前途暗淡，苦海无边；也许您曾经遭遇世间人情冷暖，甚至不被亲人理解；也许......而今当您来到这里，一切都将会有一个不一样的开始！</p><p>相信用我们精湛的专业知识和真诚的助人之心，定能为您抚慰伤痛疲惫的心灵，重塑健康美好的人生。</p><p>期待我们共同携手，共创美好的明天！</p><p>联系电话：67517043  67492086  65503445</p>',
  },
  {
    id: '4',
    title: '儿童青少年科',
    content:
      '<p>重庆市精神卫生中心儿童青少年科成立于2019年，作为中心新兴培育学科重点建设以来，科室团队现有博士1名、硕士4名，硕士生导师2名，专业覆盖精神病学、儿科学、神经病学、心理学和康复医学等领域，实行多学科联合诊疗。团队主要成员蒋国庆主任医师任中华医学会精神病学分会委员，其他成员在多个国家级、省级学会专委会任职。近3年来，儿少团队获批省部级课题4项，发表中文核心期刊十余篇，举办儿少精神心理健康继续教育项目5项。</p><p>科室主要诊疗范围：（1）神经发育障碍性疾病及其共患病，包括：注意缺陷多动障碍、自闭症谱系障碍、抽动障碍和学习困难等；（2）儿童青少年情绪障碍：如焦虑、抑郁、强迫、自伤自杀行为和睡眠障碍等；（3）儿童青少年精神分裂症和双相情感障碍等。2020年门诊量逾6000人次，目前在重庆市首家开展了成人多动症专病门诊。</p><p>2021年6月，科室搬迁至门诊大楼四、五、六层，科室硬件环境全新打造、全面升级。设有独立的儿童青少年心理测评室，配置专业的儿童测评软件和量表，科学地测试患儿的情绪状态、注意力和社会功能等；还设有绘画治疗室、沙盘游戏室和家庭治疗室，开展多种适合儿童青少年的心理咨询和心理治疗。</p><p>同时，引进多种国内外先进的诊疗及康复设备，为患者提供更加舒适、高质量的诊治体验。如：西部地区首先运用于临床的近红外脑功能成像近红外脑功能成像检查设备ETG-4000，52通道近红外光客观数值精准反映患儿的大脑激活程度，为多种精神心理疾病提供辅助诊断依据和疗效判断。</p><p>为更好地呵护儿童青少年心理健康，重庆市精神卫生中心儿童青少年科全体医护人员秉承全心服务理念，全力为您解决孩子心身问题！</p><p>咨询电话：023-67834713</p>',
  },
  {
    id: '5',
    title: '睡眠医学中心',
    content:
      '<p>重庆市精神卫生中心成立睡眠医学中心，通过一系列评估、检测等手段，帮助患者找到引发睡眠障碍的原因，消除心理障碍对睡眠的影响，掌握正确的睡眠卫生知识，促进患者自觉主动调整睡眠，避免惧怕用药和滥用药物带来的不良问题；通过追踪回访，使患者的睡眠问题得以彻底的解决。</p><p>睡眠医学中心由睡眠障碍病房、睡眠障碍门诊及睡眠检查室三部分组成。配有2个独立单人标准睡眠监测室，环境安静、整洁，既可保证数据采集的可靠性，又可方便病人休息及洗漱。睡眠障碍病房设有38张病床，病房环境优雅、配套设施齐全。中心现有先进的多导睡眠监测仪2套、便携式睡眠监测仪6套及体动记录仪10套。治疗方面配有失眠的认知行为治疗系统、失眠治疗仪、贝多芬心身睡眠音乐治疗床、经颅磁刺激治疗仪、中医艾灸穴位治疗等。</p><p>睡眠医学中心开展全夜多导睡眠监测、便携式睡眠呼吸监测、多次小睡试验、动态视频脑电监测和睡眠呼吸事件时的呼吸努力评价等多种检测项目，主要是针对各类常见的睡眠障碍，如原发性失眠、精神障碍伴发失眠、鼾症、嗜睡、发作性睡病、睡眠呼吸暂停、昼夜节律异常、快速眼球运动睡眠期行为异常以及镇静催眠药依赖等疾患进行综合检查和全方位治疗。</p>',
  },
  {
    id: '6',
    title: '康复中心',
    content:
      '<p>重庆市精神卫生中心康复中心是由经验丰富的医师、护士和康复治疗师组成的康复训练队伍，对患者有爱心、耐心、责任心、热情周到，率先在全市开展精神康复治疗与研究。康复训练环境宽敞、美丽，设施齐全。开展的康复治疗项目有：音乐治疗、生活技能训练、行为训练、作业训练、脑电生物反馈治疗、社交技能训练、运动训练等。适用于各类急、慢性精神病人的病情稳定者，对患者针对性的制定训练计划，用循序渐进的科学方法进行训练。使患者康复一一成为现实，让众多患者回归家庭，回归社会为千万个家庭带来了久违微笑。</p><p>生活技能训练：训练病人自我照顾能力，增强病人的主动性和自觉性，预防病人精神衰退。</p><p>行为训练：以行为学理论为指导，帮助病人建立或消除某些行为。</p><p>作业训练：作为病人接触社会、适应社会的实验基地。培养病人获得工作机会的积极性，提高病人的交流技能和职业技能。操作时参考病人爱好特长安排院内作业治疗等。</p><p>社交技能训练：提高病人的社交技能和独立生活能力。预防疾病复发，提高应付人际和社会刺激的能力。</p><p>运动治疗：根据自己的兴趣爱好选择一些项目，每季度举办一次单项比赛，每年举办2次运动会，每逢重要节日到来时举办病人联欢娱乐活动。</p><p>脑功能生物反馈治疗：通过电脑输出信息启动病人大脑意念控制调节，将信息重新反馈到电脑以此反复循环，改变病人的大脑机能状态。</p><p>音乐治疗：应用音乐治疗的原理，调整他们的心情，改善注意力和认知功能。</p><p>联系电话：67518114</p>',
  },
  {
    id: '7',
    title: '早期干预科',
    content:
      '<p>该科系我中心的重点学科（包括早期干预一病区和早期干预二病区），也是西南地区率先成立的精神科早期系统干预治疗精神疾病的科室（成立于2001年5月），技术力量雄厚，共有43位工作人员，其中有4位高级职称专家、11位中级职称人员，临床一线工作均由资深医护人员担任，整个诊疗模式充分体现“以人为本、全病程治疗”的理念，在系统药物治疗的同时，侧重心理治疗及心理护理，更有助于提高精神病人的治愈率，降低复发率，缩短整个疾病治疗时间从而减轻病人和家庭的疾病负担，从而体现 “早发现、早诊断、早治疗、早康复”的特点。科室共设床位90张，分别为单人间、双人间及三人间，其中单、双人间提供空调、电视及24小时热水等，此外还设有娱疗活动室，给予住院患者提供生活方便及充分活动空间。</p>',
  },
  {
    id: '8',
    title: '心理测验室',
    content:
      '<p>重庆市精神卫生中心心理测验室采用先进的心理测验设备和工具，提供人格、智力测定和各种心理卫生问题的辅助诊断。我院引进心理CT是目前国内应用最多的心理测量工具，可对正常人和心理障碍者进行心理健康、心理素质两方面比较安全的测量。广泛应用于学业咨询、职业咨询、心理咨询、精神卫生、婚恋咨询、司机考评、征兵、司法鉴定和特殊人员选拔等，可以预测自杀、暴力、吸毒、酗酒等危险行为。以及招生、招工、招干和某些特殊行业及工种从业人员体验参考。我科室还有专门针对儿童智力测试，儿童气质类型测试， 注意力测试，孤独症筛查等检测。近几年随着医学发展精神和心理疾病引起的认知功能下降越来越受到关注，我院为了保证患者的全面恢复，我科室特引进了回笼观医院的（MCCB）认知功能成套测验，主要从精神运动速度，注意（警觉），工作记忆，言语学习和记忆，视觉学习和记忆，推理和问题解决等反应患者的认知功能。</p><p>联系电话：67515141  65503545</p>',
  },
]
export default list
